"""Задание:
Сколько существует разных способов подняться лестницей в n ступенек
Если можно шагать на 1, 2 или 3 ступеньки вперёд.
Решить с помощью рекурсии.
"""


def find_step(n):
    if n == 0:
        return 1
    elif n < 0:
        return 0
    else:
        return find_step(n - 3) + find_step(n - 2) + find_step(n - 1)


n = int(input('Введите количество ступенек n: '))
print(f"Количество способов подняться лестницей если можно шагать на 1, 2 или 3 =  {find_step(n)}")
